frontend/dao/BookCommentDao.php

    public function bookList(){
      $bookName =  Book::tableName();
      $dataProvider = new ActiveDataProvider([
            'query' => Book::find()->orderBy('id'),   //依赖容器注入
            'pagination'=>['PageSize'=>10]
      ]);
---
SELECT * FROM `bw_book` ORDER BY `id` LIMIT 10
SELECT COUNT(*) FROM `bw_book`